def multi_pie(label_list,value_list,args):
    '''
    data={'电影类型':['剧情','爱情','喜剧','冒险','奇幻','犯罪','动画','惊悚','动作','悬疑','科幻','家庭','战争','传记','古装','音乐','同性',
               '历史','歌舞','儿童','武侠','纪录片','西部','情色','恐怖','灾难','运动'],
     '出现次数':[186,58,52,49,43,42,37,33,30,29,23,20,15,15,10,9,8,8,6,4,4,3,3,2,2,2,2],
     '包含该类型的电影平均得分':[8.962,8.893,8.904,8.914,8.919,8.910,8.924,8.824,8.873,8.859,8.887,8.925,9.033,8.96,8.840,8.944,8.937,9.200,8.967,8.875,8.700,
               9.033,8.867,8.800,8.900,9.050,8.850],
     '包含该类型的电影平均评论人数':[748926,778797,841681,802914,782110,726729,749715,693095,780889,695576,856407,608761,622827,808412,772979,
                       1042130,770385,656149,839700,483575,588553,165585,850578,872586,404316,1663188,923347],
     '包含该类型的电影年平均评论人数':[54717,45209,69347,62792,50969,48014,63827,52480,54135,47326,70537,56167,31679,78742,25366,145034,
                        62084,30942,56439,40354,18658,24115,64230,45408,16019,125511,121163],
     '包含该类型的电影的年平均下降分数':[0.0763,0.0693,0.0796,0.0791,0.0681,0.0741,0.0818,0.0810,0.0727,0.0734,0.0856,0.0990,0.0491,0.0981,0.0376,0.1629,
                         0.1086,0.0447,0.0683,0.1008,0.0417,0.0923,0.0758,0.0645,0.0395,0.1096,0.1179]}
    multi_pie(data['电影类型'],data['出现次数'],args={'row':5,'col':2})
    '''
    import matplotlib.pyplot as plt
    plt.rcParams['font.sans-serif'] = ['SimHei']  # 使用指定的汉字字体类型（此处为黑体）
    plt.rcParams["axes.unicode_minus"] = False  # 该语句解决图像中的“-”负号的乱码问题#
    fig,axj=plt.subplots(nrows=args['row'],ncols=args['col'],figsize=(args['col']*4,args['row']*3)) #建立饼图坑
    axes = axj.flatten() #子图展平
    for ax in range(args['row']*args['col']):
        city = label_list[ax+1:ax+6]
        consumption =value_list[ax+1:ax+6]
        col_sum = sum(consumption)
        share = []
        for j in consumption:#计算均值
            share.append(round(j/col_sum,4))
        axes[ax].pie(x=share,labels=city,autopct = '%3.1f%%')
        axes[ax].set_title("第"+str(ax+1)+"张图")
        plt.subplots_adjust(left=None, bottom=None, right=None, top=None, wspace=0.5, hspace=0.2)  # 调整子图间距
        # plt.savefig('./data/居民消费价格指数.jpg')
    plt.show()